IDENTIFICATION DIVISION.
PROGRAM-ID. SALESREAD.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT SALES-FILE ASSIGN TO "sales.txt"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD SALES-FILE.
01 SALES-REC.
   05 SALE-DATE    PIC X(8).
   05 PRODUCT-ID   PIC X(4).
   05 SALE-STORE   PIC X(10).
   05 SALE-AMOUNT  PIC 9(10).

WORKING-STORAGE SECTION.
01 EOF-FLAG PIC X VALUE "N".

PROCEDURE DIVISION.

    OPEN INPUT SALES-FILE

    PERFORM UNTIL EOF-FLAG = "Y"

        READ SALES-FILE
            AT END
                MOVE "Y" TO EOF-FLAG
            NOT AT END
                DISPLAY SALES-REC
        END-READ

    END-PERFORM

    CLOSE SALES-FILE

    STOP RUN.
    